saveChangesOnExit = Da li \u017Eelite da sa\u010Duvate izmene pre zatvaranja?
saveChangesOnExitTitle = \u010Cuvanje izmena
file = Fajl
edit = Izmeni
help = Pomo\u0107
new = Novi
save = Sa\u010Duvaj
open = Otvori
students = Studenti
subjects = Predmeti
professors = Profesori
departments = Katedre
close = Zatvori
delete = Obri\u0161i
about = O aplikaciji
departmentId = \u0160ifra katedre
departmentName = Naziv katedre
departmentHead = Rukovodilac katedre
subjectNotChosen = Niste odabrali predmet!
subjectId = \u0160ifra predmeta
subjectName = Naziv predmeta
espb = ESPB
mark = Ocena
date = Datum
yearOfStudy = Godina studija
semester = Semestar
summer = LETNJI
winter = ZIMSKI
error = GRESKA!
sureToDeleteStudent = Da li ste sigurni da \u017Eelite da obri\u0161ete studenta?
deleteStudent = Brisanje studenta
studentNotChosen = Niste odabrali studenta!
sureToDeleteProfessor = Da li ste sigurni da \u017Eelite da obri\u0161ete profesora?
deleteProfessor = Brisanje profesora
professorNotChosen = Niste odabrali profesora!
sureToDeleteSubject = Da li ste sigurni da \u017Eelite da obri\u0161ete predmet?
subjectDelete = Brisanje predmeta
professorChoose = Odaberi profesora
confirm = Potvrdi
cancel = Odustani
warning = Upozorenje!
professorChosen = Profesor uspe\u0161no odabran!
studentEdit = Izmena studenta
placeHead = Postavi rukovodioca
studentServices = Studentska slu\u017Eba
studentServicesStudents = Studentska slu\u017Eba - Studenti
studentServicesProfessors = Studentska slu\u017Eba - Profesori
studentServicesSubjects = Studentska slu\u017Eba - Predmeti
add = Dodaj
search = Pretra\u017Ei
surname = Prezime
name = Ime
birthDate = Datum ro\u0111enja
streetLiving = Ulica stanovanja
numberLiving = Broj stanovanja
cityLiving = Grad stanovanja
countryLiving = Dr\u017Eava stanovanja
phone = Broj telefona
email = E-mail adresa
streetOffice = Ulica kancelarije
numberOffice = Broj kancelarije
cityOffice = Grad kancelarije
countryOffice = Dr\u017Eava kancelarije
idNumber = Broj li\u010Dne karte
title = Zvanje
yearsOfExperience = Godine radnog sta\u017Ea
info = Informacije
addSubject = Dodaj predmet
subjectAdded = Predmet uspe\u0161no dodat!
subjectHasProfessorAlready = Izabrani predmet ve\u0107 ima dodeljenog profesora, izvr\u0161iti izmenu?
professorSubstitute = Zamena profesora
removeSubject = Ukloni predmet
deleteSubject = Brisanje predmeta
sureToDeleteSubjectFromProfessor = Da li ste sigurni da \u017Eelite da obri\u0161ete predmet sa profesora?
subjectDeleted = Predmet uspe\u0161no obrisan!
subjectNotDeleted = Predmet nije obrisan!
addStudent = Dodavanje studenta
indexNumber = Broj indeksa
enrollmentYear = Godina upisa
currentYearOfStudy = Trenutna godina studija
firstYear = I (Prva)
secondYear = II (Druga)
thirdYear = III (Tre\u0107a)
fourthYear = IV (\u010Cetvrta)
finanseWay = Na\u010Din finansiranja
budget = Bud\u017Eet
selfFinansing = Samofinansiranje
editStudent = Izmena studenta
passed = Polo\u017Eeni
notPassed = Nepolo\u017Eeni
gradeEntry = Unos ocene
gradeEntered = Ocena uspe\u0161no upisana!
cancelGrade = Poni\u0161ti ocenu
sureToCancelGrade = Da li ste sigurni da \u017Eelite da poni\u0161tite ocenu?
gradeCancelation = Poni\u0161tavanje ocene
gradeNotChosen = Ocena nije selektovana!
avgGrade = Prose\u010Dna ocena: 
totalESPB = Ukupno ESPB: 
passing = Polaganje
subjectAdding = Dodavanje predmeta
professor = Profesor
professorDelete = Uklanjanje profesora
sureToDeleteCurrentProfessor = Da li ste sigurni da \u017Eelite da uklonite trenutnog profesora?
avgGrades = Prosek ocena
idUnique = Broj li\u010Dne karte mora biti jedinstven!
dateFormat = Unesite datum u formatu: DD.MM.YYYY.
enterStreet = Unesite ulicu!
enterNumber = Unesite broj!
enterCity = Unesite grad!
enterCountry = Unesite dr\u017Eavu!
enterPhone = Unesite broj telefona!
enterEmail = Unesite ispravan email!
enterStreetOffice = Unesite ulicu kancelarije!
enterNumberOffice = Unesite broj kancelarije!
enterCityOffice = Unesite grad kancelarije!
enterCountryOffice = Unesite dr\u017Eavu kancelarije!
idIncorrect = Neispravan broj li\u010Dne karte!
workYearsIncorrect = Neispravno unet radni sta\u017E!
searchProfessor = Unete vrednosti nisu dobre! Mogu\u0107e opcije su: [prezime], [prezime,ime]
searchStudent = Unete vrednosti nisu dobre! Mogu\u0107e opcije su: [prezime], [prezime,ime], [prezime,ime,indeks]
indexUnique = Indeks mora biti jedinstven!
indexFormat = Indeks mora biti u formatu: SMER BROJ_UPISA/GODINA_UPISA
enrollmentYearMustBeNumber = Godina upisa mora biti broj!
statusChooseIncorrect = Nepostoje\u0107i odabir statusa studenta!
idSubjectUnique = Id predmeta mora biti jedinstven!
espbFormat = ESPB mora biti broj!
semesterChooseIncorrect = Nepostoje\u0107i odabir semestra!
language = Jezik
serbian = Srpski
english = Engleski
yes = Da
no = Ne
ok = Potvrdi
cancel = Odustani
searchSubjects = Unete vrednosti nisu dobre! Mogu\u0107e opcije su: [naziv predmeta], [naziv predmeta,\u0161ifra predmeta]
editProfessor = Izmena profesora
addProfessor = Dodavanje profesora
editSubject = Izmena predmeta
helpPage =				UPUTSTVO ZA KORI\u0160\u0106ENJE APLIKACIJE\r\n\
						\r\n\
						\r\n\
						*TABELA STUDENATA\r\n\
						I)\r\n\
						Dodavanje studenta se vr\u0161i pomo\u0107u dugmeta u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> New pod uslovom da je tab studenti otvoren.\r\n\
						Provera ispravnosti unetih podataka:\r\n\
							-Ispravan format datuma: dan.mesec.godina.\r\n\
							-broj telefona nema ograni\u010Denje\r\n\
							-Ispravan format indeksa: (X)X (YY)Y/XXXX - npr. RA 31/2019.\r\n\
							-Indeks mora biti jedinstven\r\n\
							-Email mora sadr\u017Eati \"@\".\r\n\
							-Sva polja moraju biti popunjena da bi dodavanje bilo mogu\u0107e.\r\n\
						II)\r\n\
						Izmena studenta se vr\u0161i pomo\u0107u dugmeta  u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> Edit -> Edit pod uslovom da je tab studenti otvoren.\r\n\
						Student prethodno mora biti selektovan u tabeli kako bi izmena bila mogu\u0107a.\r\n\
						Provera ispravnosti unetih podataka je ista kao za unos novog studenta, polje za broj indeksa se ne mo\u017Ee menjati.\r\n\
						U okviru dijaloga za izmenu studenata, nalaze se tri taba, jedan sa informacija, drugi sa ispitima koje je student polo\u017Eio, i tre\u0107i sa ispitima koje student nije polo\u017Eio.\r\n\
						Prilikom otvaranja dijaloga za izmenu studenta otvara se prvi tab u okviru kog se vr\u0161i izmena.\r\n\
						Prelaskom na drugi tab, imamo informacije o predmetima koje je student polo\u017Eio(Broj ESPB bodova koliko predmet nosi, ocena, datum polaganja...).\r\n\
						U okviru ovog taba postoji mogu\u0107nost poni\u0161tavanja ocene. Ako se ocena poni\u0161ti, predmet se prebacuje u listu nepolo\u017Eenih predmeta za zadatog studenta.\r\n\
						Prelaskom na tre\u0107i tab, imamo informacije o predmetima koje student nije polo\u017Eio(Broj ESPB bodova koliko predmet nosi, godina studija na kojoj se predmet izvodi, semestar u kom se predmet izvodi...).\r\n\
						U okviru ovog taba postoji mogu\u0107nost dodavanja nove ocene, brisanje ocene, i postoji opcija \"polaganje\" koja nam omogu\u0107ava da prebacimo ocenu iz liste nepolo\u017Eenih u listu polo\u017Eenih ukoliko je student polo\u017Eio predmet.\r\n\
						III)\r\n\
						Brisanje studenta se vr\u0161i pomo\u0107u dugmeta u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> Edit -> Delete pod uslovom da je tab studenti otvoren.\r\n\
						Student kog \u017Eelite da uklonite iz tabele tako\u0111e mora biti prethodno selektovan.\r\n\
						\r\n\
						*TABELA PROFESORA\r\n\
						I)\r\n\
						Dodavanje profesora se vr\u0161i pomo\u0107u dugmeta u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> New pod uslovom da je tab profesori otvoren.\r\n\
						Provera ispravnosti unetih podataka:\r\n\
							-Ispravan format datuma: dan.mesec.godina.\r\n\
							-broj telefona nema ogran\u010Denje\r\n\
							-Email mora sadr\u017Eati \"@\".\r\n\
							-Broj li\u010Dne karte mora biti jedinstven\r\n\
							-Ostala polja nemaju specijalnih ograni\u010Denja\r\n\
							-Sva polja moraju biti popunjena da bi dodavanje bilo mogu\u0107e.\r\n\
						II)\r\n\
						Izmena profesora se vr\u0161i pomo\u0107u dugmeta  u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> Edit -> Edit pod uslovom da je tab profesori otvoren.\r\n\
						Profesor prethodno mora biti selektovan u tabeli kako bi izmena bila mogu\u0107a.\r\n\
						Provera ispravnosti unetih podataka je ista kao za unos novog profesora, polje za broj li\u010Dne karte se ne mo\u010De menjati.\r\n\
						U okviru dijaloga za izmenu profesora, nalaze se dva taba, jedan sa informacija, drugi sa predmetima koje profesor predaje.\r\n\
						Prilikom otvaranja dijaloga za izmenu profesora otvara se prvi tab u okviru kog se vr\u0161i izmena.\r\n\
						Prelaskom na drugi tab, imamo informacije o predmetima koje profesor predaje(Broj ESPB bodova koliko predmet nosi, godina studija na kojoj se predmet izvodi, semestar u kom se predmet izvodi...).\r\n\
						U okviru ovog taba mo\u017Eemo profesoru da dodamo novi predmet ili da uklonimo postoj\u0107i.\r\n\
						III)\r\n\
						Brisanje profesora se vr\u0161i pomo\u0107u dugmeta u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> Edit -> Delete pod uslovom da je tab profesori otvoren.\r\n\
						Profesor kog \u017Elite da uklonite iz tabele tako\u0111e mora biti prethodno selektovan.\r\n\
						\r\n\
						*TABELA PREDMET\r\n\
						I)\r\n\
						Dodavanje predmeta se vr\u0161i pomo\u0107u dugmeta u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> New pod uslovom da je tab predmeti otvoren.\r\n\
						Provera ispravnosti unetih podataka:\r\n\
							-\u0160ifra predmeta mora biti u formatu: string+int - npr. p1.\r\n\
							-Ostala polja nemaju specijalnih ograni\u010Denja\r\n\
						Prilikom dodavanja predmeta, imamo opciju da predmetu \"dodamo\" profesora(svakom predmetu doda\u0107emo koji profesor ga predaje), a profesor mo\u017Ee ostati i nepopunjen(u slu\u010Daju da niko trenutno ne predaje predmet).\r\n\
						II)\r\n\
						Izmena predmeta se vr\u0161i pomo\u0107u dugmeta  u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> Edit -> Edit pod uslovom da je tab predmeti otvoren.\r\n\
						Predmet prethodno mora biti selektovan u tabeli kako bi izmena bila mogu\u0107a.\r\n\
						Dijalog za izmenu predmeta je potpuno isti kao dijalog za dodavanje predmeta samo je popunjen sa akutelnim podacima iz tabele za ozna\u010Dni predmet.\r\n\
						III)\r\n\
						Brisanje predmeta se vr\u0161i pomo\u0107u dugmeta u toolbar-u, tako\u0111e je mogu\u0107e i preko: File -> Edit -> Delete pod uslovom da je tab predmeti otvoren.\r\n\
						Predmet kog \u017Eelite da uklonite iz tabele tako\u0111e mora biti prethodno selektovan.\r\n\
						\r\n\
						*TABELA KATEDRE\r\n\
						Tabeli katedre pristupamo pomo\u0107u FILE -> OPEN -> KATEDRE ili preko mnemonika CTRL + K.\r\n\
						U ovoj tabeli imamo informacije o rukovodiocima katedri. Mogu\u0107e je postaviti nove rukovodioce. Lista katedri se ne mo\u017Ee menjati.\r\n\
						\r\n\
						*SORTIRANJE\r\n\
						Sortiranje je mogu\u017Ee izvr\u017Eiti na osnovu bilo koje kolone. Klikom na naziv odgovaraju\u0107e kolone, tabela se sortira po toj koloni.\r\n\
						\r\n\
						*PRETRAGA\r\n\
						"Prilikom pretrage, pretrauje se tabela odgovaraju\u0107eg otvorenog taba.\r\n\
						"U koliko je otvoren tab:\r\n\
						"1)Studenti\r\n\
						"Pretraga se vr\u0161i u formatu: \"prezime[,ime,broj_indeksa]\"!\r\n\
						"2)Profesori\r\n\
						"Pretraga se vr\u0161i u formatu: \"prezime[\" \"ime]\"!\r\n\
						"3)Predmeti\r\n\
						"Pretraga se vr\u0161i u formatu: \"naziv[,sifra]\"!\r\n\
						"gde [] ozna\u010Davaju opciono navo\u0111enje.\r\n\
						"\r\n\
						"*LOKALIZACIJA(JEZIK)\r\n\
						"U okviru Meni bara odabirom opcije \"JEZIK\" mo\u017Eemo odabrati ponu\u0111ene jezike.\r\n\
						"Podr\u017Ean je srpski i engleski jezik.\r\n\
						"\r\n\
						"*PR\u010CICE\r\n\
						"CTRL + N - otvara novi prozor za dodavanje novog(studenta, predmeta, profesora) u zavisnosti koji je tab otvoren.\r\n\
						"CTRL + S - sa\u010Duvava izmene\r\n\
						"CTRL + C - zatvaranje programa\r\n\
						"CTRL + E - otvara novi prozor za izmenu (studenta, predmeta, profesora) u zavisnosti koji je tab otvoren.\r\n\
						"CTRL + D - brisanje (studenta, predmeta, profesora) u zavisnoti koji je tab otvoren.\r\n\
						"CTRL + H - otvaranje ovog prozora(HELP).\r\n\
						"CTRL + A - otvaranje \"about\" prozora.\r\n\
						"CTRL + K - otvaranje tabela katedri.
aboutPage = 			\t O APLIKACIJI\n\
						Aplikacija koja simulira rad studentske slu\u017Ebe.\n\
						Za vi\u0161e informacija pogledati prozor 'HELP'.\n\n\n\
						Verzija: 1.0\n\n\n\
						Autori:\n\
						     Milo\u0161 Zeljko RA 24/2019\n\
						     Mihailo Velji\u0107 RA 31/2019